In [157]:
import pandas as pd

india_weather = pd.DataFrame({
    "city" : ["Mumbai","Delhi","Bangalore"],
    "temperature" :[32,45,30],
    "humidity" : [80,60,78]
})
india_weather

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78

df.max()

In [158]:
import pandas as pd

us_weather = pd.DataFrame({
    "city" : ["New York","Chicago","Orlando"],
    "temperature" :[21,14,35],
    "humidity" : [68,65,75]
})
us_weather

       city  temperature  humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [162]:
df = pd.concat([india_weather,us_weather], ignore_index = True)
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78
3   New York           21        68
4    Chicago           14        65
5    Orlando           35        75

In [163]:
df = pd.concat([india_weather,us_weather], keys = ['India','US'] )
df

              city  temperature  humidity
India 0     Mumbai           32        80
      1      Delhi           45        60
      2  Bangalore           30        78
US    0   New York           21        68
      1    Chicago           14        65
      2    Orlando           35        75

In [166]:
df.loc['India']

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78

In [176]:
import pandas as pd
temperature = pd.DataFrame({
 	"city" : ["Mumbai","Delhi","Bangalore"],
    "temp" :[42,48,33]
}, index=[0,1,2])
temperature

        city  temp
0     Mumbai    42
1      Delhi    48
2  Bangalore    33

In [177]:
import pandas as pd
windspeed = pd.DataFrame({
 	"city" : ["Delhi","Mumbai"],
    "temp" :[23,19],
}, index =[1,0])
windspeed

     city  temp
1   Delhi    23
0  Mumbai    19

In [179]:
s = pd.Series(["Humid","Dry","Rain"], name = "event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [180]:
df = pd.concat([temperature,s], axis = 1)
df

        city  temp  event
0     Mumbai    42  Humid
1      Delhi    48    Dry
2  Bangalore    33   Rain